{"0": {"company": "Saama Technologies Inc", "description": "Title – Data Scientist\n\nDescription\n\nDoes solving complex business problems and real world challenges interest you? Do you enjoy seeing the impact your contributions make on a daily basis? Are you passionate about using data analytics to provide game changing solutions to the Global 2000 clients? Do you thrive in a dynamic work environment that constantly pushes you to be the best you can be and more? Are you ready to work with smart colleagues who drive for excellence in everything they do?\n\nIf you possess a solutions mind-set, strong architecting skills, and commitment to be part of a tremendous journey, come join our growing, global team. See what Saama can do for your career and for your journey.\n\nRequirement –\n4 or more years’ experience in business, consulting or applied field research with responsibilities for solving analytics problems using quantitative approaches.\nExtensive knowledge of standard statistical techniques like MLE/QMLE, GMM, OLS/GLS, univariate and multivariate time series models (e.g. ARIMA, DLM's, VAR's), regression model diagnostics for time series and cross sectional data, along with Machine Learning methodologies like Random Forests, SVM's and Boosting/Bagging.\nExperience working with large data sets using distributed computing tools, e.g. Map/Reduce, Hadoop, Hive, Spark etc.\nExpert knowledge of an analysis tool/statistical package such as R, JMP, SPSS, SAS, Matlab\nFluency with at least one scripting language such as Python, Java, or C/C++.\nExpertise with relational databases and SQL. NoSQL is a big plus\nSaama Values:\nINTEGRITY: we do the ‘right’ things.\nINNOVATION: we ‘change the game.’\nTRANSPARENCY: we communicate openly\nCOLLABORATION: we work as one team\nPROBLEM-SOLVING: we solve core, complex business challenges\nENJOY & CELEBRATE: we have fun\n\n\nCompetencies:\nSelf-starter who gets results with minimal support and direction in a fast-paced environment.\nTakes initiative; challenges the status quo to drive change.\nLearns quickly; takes smart risks to experiment and learn.\nWorks well with others; builds trust and maintains credibility.\nPlanful: identifies and confirms key requirements in dynamic environments; anticipates tasks and contingencies.\nCommunicates effectively; productive communication with clients and all key stakeholders communication in both verbal and written communication.\nStays the course despite challenges & setbacks. Works well under pressure.\nStrong analytical skills; able to apply inductive and deductive thinking to generate solutions for complex problems.\nWork Environment:\nThis job operates in a professional office environment. This role routinely uses standard office equipment, including but not limited to, computers, phones, and photocopiers.\n\nPhysical Demands\nThis position requires the frequent and repetitive use of a computer, keyboard, and mouse. Hand and finger dexterity is required.\n\nOther Duties\nPlease note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.\n\nEEO\nSaama Technologies, Inc. provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nThis policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.\nApply Now: click Apply Now"}, "1": {"company": "Walmart eCommerce", "description": "Position Description\n\nData Scientist is responsible for analyzing large data sets to develop custom models and algorithms to drive business solutions. Data Scientists work on project teams in order to provide analytical support to projects for Walmart eCommerce. Data Scientists are responsible for building large data sets from multiple sources in order to build algorithms for predicting future data characteristics. Those algorithms will be tested, validated, and applied to large data sets. Data Scientists are responsible for training the algorithms so they can be applied to future data sets and provide the appropriate search results. Data Scientists are responsible for researching new trends in the industry and utilizing up-to-date technology\n\nMinimum Qualifications\n\nKey Responsibilities\n• Understands and translates business and functional needs into data scientist problem statements\n• Build complex data sets from multiple data sources, both internally and externally.\n• Develop custom data models to drive innovative business solutions.\n• Write complex queries and extract data to build database architecture. Integrate data products into dashboards and user interfaces as needed, by collaborating with engineering team\n• Sift and analyze data from multiple angles, looking for trends that highlight problems or opportunities\n• Use strong business acumen, as well as an ability to communicate findings, and mine vast amounts of data for useful insights\n• Apply innovative and scientific/quantitative analytical approaches to draw conclusions and make recommendations to answer business objectives\nSkills\n• Proficiency in machine learning algorithms such as multi-class classifications, decision trees, support vector machines, and deep learning\n• Strong understanding of probability and statistical models (generative and descriptive models)\n• Ability to run experiments scientifically and analyze results\n• Ability to effectively communicate technical concepts and results to technical and business audiences in a comprehensive manner\n• Ability to collaborate effectively across multiple teams and stakeholders, including analytics teams, development teams, product management and operations\n\nAdditional Preferred Qualifications\n\nCompany Summary\n\nThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.\n\nPosition Summary\n\nData Scientist is responsible for analyzing large data sets to develop custom models and algorithms to drive business solutions. Data Scientists work on project teams in order to provide analytical support to projects for Walmart eCommerce. Data Scientists are responsible for building large data sets from multiple sources in order to build algorithms for predicting future data characteristics. Those algorithms will be tested, validated, and applied to large data sets. Data Scientists are responsible for training the algorithms so they can be applied to future data sets and provide the appropriate search results. Data Scientists are responsible for researching new trends in the industry and utilizing up-to-date technology\nApply Now: click Apply Now"}, "2": {"company": "Presbyterian Healthcare Services", "description": "Overview\n\n\nJob Description Type of Opportunity: Full Time FTE: 1.000000 Exempt: Yes Work Schedule: Days\n\nSummary:Develop innovative & sophisticated analytics models in concert with other Directors within the Analytics Organization (AO) and in partnership with IT to support analytics/reporting needs of business leaders & fellow colleagues for the real time business decision making. Support optimization and enhancement of existing analytical models utilized by the PHS across the AO. Support development and testing of analytical prototypes and contribute to analytical solutions best practices. Develop the communication strategies and transitioning of solutions to other teams within the AO. Responsible for guiding, mentoring and supporting fellow junior scientist and other analytical talent across the AO.\n\nResponsibilities\n\n\nResponsibilities:*Provide support in creating/coding, designing and testing pilot data-driven predictive/descriptive analytical models for PHS.to solve business problems leveraging the latest and most appropriate technologies in statistical modeling and machine learning*Ability to work in a diverse team setting across the AO to develop, refine and scale data management and analytics procedures, systems, workflows, best practices and other issues.*Assist in risk identification and mitigation planning and communicate to analytical senior leadership of any issues/escalations & risks*Support management of multi-tasking, achieving milestones, deadlines, and maintaining customer relationships*Support and assist healthcare reporting/analytics system implementations throughout the project life-cycle, performing workflow analysis, testing, training, go-live, system upgrades and issues management in partnership with IT *Ability and experience to deal with very granular data available through various data storage platform (e.g., Hadoop) and summarize, interpret and translate the findings to the leadership promoting data-driven strategic decision making*Design and test structured data and algorithms to support clinical, operational and financial data analysis using advanced data-driven analytical methods from statistics, data mining, econometrics, and operations research*Design models for investigations of various acute/chronic clinical and/or operational and/or financial areas, including hypotheses generation and creating an analysis plan with appropriate primary and secondary data required, and evaluate results of the analysis and interpret conclusions, taking into consideration bias/data limitations as well as performing any specialized analysis required*Create and test optimization algorithms, forecasting and predictive models for patient level outcomes, utilization management, and overall medical services*Support design, build and test of population scoring, stratification and segmentation based on predicted risk of adverse utilization/clinical and financial outcomes*Synthesize findings and conclusions including efficacy of existing programs as well as incremental impact of new care inventions and interventions; design and institute appropriate metrics to assess progress vs. projected impact.*Routinize advanced analytical and reporting methods and techniques for broader use of the AO community*Work with large and complex datasets to derive and validate predictive models across clinical, operational and financial areas*Collaborate and partner with management, project managers, and IT to identify cases that can benefit from predictive analytics and other advanced statistical techniques*Visualize, interpret, report, and communicate data findings creatively in a various formats and audiences*Support advanced analytical and data mining efforts which could include but not limited to clustering, segmentation, logistic and multivariate regression, decision/CART trees, neural networks, time-series analysis, sentiment analysis, topic modeling, random forests, and Bayesian analysis *Support collaboration with other analytics stakeholder to define, gather requirements and build a pilot prototype BI tools*Provide support in designing and development of reusable analytical assets (data structures, code, solutions); test and improvise improvements to existing assets; and conduct evaluation of the suitability and value of potential new assets*Assist in developing training material and provide hands-on mentoring to analytical talent on the appropriate use and interpretation of new analytical models, integration of these models into existing business analyses as well as assure, maintain and improve efficiency and quality; validate work product of peers across the AO*Assist with the preparation of documents/publications and presentation materials describing analytic methods, observations and findings in the AO area *Contribute towards and assist Informaticists leadership in developing a year-end value story to demonstrate value of the team and their contribution to progress towards the AOs and PHSs goals.\n\nQualifications\n\n\nOther information:Bachelors degree in an econometrics, physics, biostatistics, computer science, applied mathematics, engineering or any other quantitative related subject area. A Masters or a Ph.D. is highly preferred. Four or more years of related business intelligence, statistical/mathematical, predictive modeling along with the business strategy experience required. Understanding of natural language processing, machine learning, conceptual modelling and hypothesis testing as well as relational database management systems (Oracle, Teradata, SQL Server, DB2 etc.) Knowledge of healthcare industry and healthcare information standards such as HL7, LOINC, FHIR, ICD 9/10 and CPT codes, industry standard groupers (e.g., ETGs, DRGs, DCGs, etc.) as well as of the health care delivery system processes. Experience in big data technologies such as Hadoop, Spark, Kafka, Storm, R, Python, SQL, no-SQL databases, database analytics and graph databases is a PLUS. Adept in using BI tools (e.g., Business Objects/BO, Cognos), data visualizations tools (e.g., Tableau), statistical software such as SAS and general health service research and reporting/analytics. Working knowledge of extract transform and loading (ETL), data cleaning, data normalization/mapping and business process management (BPM) is expected. Experience in mathematical modeling skills including but not limited to classification, regression, survival analysis, recommender systems, experimentation systems (A/B testing), hypothesis testing and supporting development of mathematical algorithms.\n\nPreferred Qualifications:\nEvidence based care work\nClinical analytics background\nExperience with Epic\nStatistical analysis background\nExperience with SAS, R, Python, Tableau\nBenefits\n\n\nBenefits Benefits are effective day-one (for .45 FTE and above) and include:\nCompetitive salaries\nFull medical, dental and vision insurance\nFlexible spending accounts (FSAs)\nFree wellness programs\nPaid time off (PTO)\nRetirement plans, including matching employer contributions\nContinuing education and career development opportunities\nLife insurance and short/long term disability programs\nAbout Us Presbyterian Healthcare Services is a locally owned, not-for-profit healthcare system of nine hospitals, a statewide health plan and a growing multi-specialty medical group. Founded in New Mexico in 1908, it is the state's largest private employer with approximately 11,000 employees.\n\nPresbyterian's story is really the story of the remarkable people who have chosen to work here. Starting with Reverend Cooper who began our journey in 1908, the hard work of thousands of physicians, employees, board members, and other volunteers brought Presbyterian from a tiny tuberculosis sanatorium to a statewide healthcare system, serving more than 700,000 New Mexicans. We are part of New Mexico's history - and committed to its future. That is why we will continue to work just as hard and care just as deeply to serve New Mexico for years to come. About New Mexico New Mexico's unique blend of Spanish, Mexican and Native American influences contribute to a culturally rich lifestyle. Add in Albuquerque's International Balloon Fiesta, Los Alamos' nuclear scientists, Roswell's visitors from outer space, and Santa Fe's artists, and you get an eclectic mix of people, places and experiences that make this state great. Cities in New Mexico are continually ranked among the nation's best places to work and live by Forbes magazine, Kiplinger's Personal Finance, and other corporate and government relocation managers like Worldwide ERC. New Mexico offers endless recreational opportunities to explore, and enjoy an active lifestyle. Venture off the beaten path, challenge your body in the elements, or open yourself up to the expansive sky. From hiking, golfing and biking to skiing, snowboarding and boating, it's all available among our beautiful wonders of the west. AA/EOE/VET/DISABLED. PHS is a drug-free and tobacco-free employer with smoke free campuses.\n\nAD123\n\n#CB\nApply Now: click Apply Now"}, "3": {"company": "Walmart eCommerce", "description": "Position Description\n\nWe, Smart Pricing, are Big Data Engineers, Data Analysts, Data Scientists and Applications Engineers, working in small groups to solve sophisticated and impactful problems. We are building systems that ingest, model and analyze massive flow of data from online and offline commerce/user activity to set pricing for millions of products. We use advanced statistical modeling, optimization techniques, machine learning, and data mining underneath it all to analyze all this data on top of Hadoop/HBase/Hive. We then build compelling data visualizations and interactive dashboards to showcase our work internally and externally.\nYour work will be immediately visible to millions of people and you will have a direct impact on the business goals of the Fortune #1 company. If this is something that excites you, come join our small team and be part of this exciting journey.\n\nJob responsibilities:\n-Research, design, develop and deploy data driven algorithmic solutions for demand forecasting, price elasticities and pricing optimization.\n-Analyze diverse sources of data to predict demand and price elasticity.\n-Work with high dimensional and fast moving data to build continually learning systems.\n-Write, present and communicate to technical and business partners.\nMinimum Qualifications\n\n-PhD in Statistics, Computational Mathematics, Operations Research, Computer Science, Econometrics, Electrical Engineering, or a related quantitative field.\n-Experience with statistical analysis and modeling and related software tools, such as R.\n-Experience with data mining, machine learning and optimization techniques and underlying algorithms.\n-Programming skills in one of the languages like Python, C, C++, or Java.\n-Working knowledge of Relational Data Base Systems and SQL.\n-Demonstrated understanding of Probability Theory and Statistics.\nAdditional Preferred Qualifications\n\n-Experience with Big Data distributed computing tools, such as Hadoop, Hive, Spark\n-Experience with Shell scripting and Linux operating system.\n\n#LI-MW1\nCompany Summary\n\nThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.\nPosition Summary\n\nWe, Smart Pricing, are Big Data Engineers, Data Analysts, Data Scientists and Applications Engineers, working in small groups to solve sophisticated and impactful problems. We are building systems that ingest, model and analyze massive flow of data from online and offline commerce/user activity to set pricing for millions of products. We use advanced statistical modeling, optimization techniques, machine learning, and data mining underneath it all to analyze all this data on top of Hadoop/HBase/Hive. We then build compelling data visualizations and interactive dashboards to showcase our work internally and externally.\nYour work will be immediately visible to millions of people and you will have a direct impact on the business goals of the Fortune #1 company. If this is something that excites you, come join our small team and be part of this exciting journey.\n\nJob responsibilities:\n-Research, design, develop and deploy data driven algorithmic solutions for demand forecasting, price elasticities and pricing optimization.\n-Analyze diverse sources of data to predict demand and price elasticity.\n-Work with high dimensional and fast moving data to build continually learning systems.\n-Write, present and communicate to technical and business partners.\nApply Now: click Apply Now"}, "4": {"company": "Walmart eCommerce", "description": "Position Description\n\nThis position is in the data science team under the Advertising Technology organization. The mission of the Advertising Technology organization is to advance Walmart eCommerce by driving higher value for our customers and vendor partners. Walmart is investing in building a world class advertising platform and the Ads team is responsible for defining and performance advertising products that drive discovery, sales and profits. The team operates an end to end advertising platform that includes a scalable ad service that serves hundreds of millions of impressions each day, sophisticated ad matching algorithms, real-time reports, self-service interface for end to end program management etc.\n\nWe are a highly motivated group of Big Data Geeks, Data Scientists and Applications Engineers, working in small agile group to solve sophisticated and high impact problems. We are building smart data systems that ingest, model and analyze massive flow of data from online and offline user activity. We use cutting edge machine learning, data mining and optimization algorithms on ad relevance, ranking and campaign optimization.\n\nJoin us if you want to be spending your time on:\nGathering and analyzing data, identifying modeling and optimization problems, devising solutions and building prototypes;\nFormulating machine learning/statistical approaches while paying attention to business metrics, designing features from the rich data available from many sources, training, evaluating, and deploying models;\nResearching and implementing methodologies to measure the impact of the technologies;\nInitiating and proposing unique and promising modeling projects, developing new and innovative algorithms and technologies, pursuing patents where appropriate;\nDeveloping high-performance algorithms for precision targeting, user engagement prediction, and ad relevance/ranking; testing and implementing these algorithms in scalable, product-ready code; interacting with other teams to define interfaces and understanding and resolving dependencies;\nStaying current on published data mining, machine learning and modeling techniques and competing technologies and sharing these findings with scientists and engineers in the organization;\nMaintaining world-class academic credentials through publications, presentations, external collaborations and service to the research community.\n\nMinimum Qualifications\n\nMasters or equivalent degree in a computational science with 4+ years of experience in Machine Learning/Statistics/Data Science;\nExperience with traditional as well as modern machine learning/statistical techniques, including Regression, Classification, Regularization, Ensemble Methods, and Neural Network;\nStrong implementation experience with high-level languages, such as Python, R, Perl, Ruby, Scala or similar scripting languages;\nFamiliarity with Linux/Unix/Shell environments;\nStrong hands-on skills in sourcing, cleaning, manipulating and analyzing large volumes of data;\nStrong written and oral communication skills.\n\nAdditional Preferred Qualifications\n\nPh.D. in a computational science with an emphasis in Machine Learning;\nExperience in online advertising, recommender system, ecommerce or relevant areas;\n2+ years of experience of writing production quality code;\nExperience with end-to-end modeling projects emerging from research efforts;\nExcellent academic or industrial track record of proposing, conducting and reporting results of original research, plus collaborative research with publications;\nKnowledge of data processing on Hadoop programming environments (e.g. Spark/Hive/Pig).\n\nCompany Summary\n\nThe Walmart eCommerce team is rapidly innovating to evolve and define the future state of shopping. As the worlds largest retailer, we are on a mission to help people save money and live better. With the help of some of the brightest minds in technology, merchandising, marketing, supply chain, talent and more, we are reimagining the intersection of digital and physical shopping to help achieve that mission.\n\nPosition Summary\n\nThis position is in the data science team under the Advertising Technology organization. The mission of the Advertising Technology organization is to advance Walmart eCommerce by driving higher value for our customers and vendor partners. Walmart is investing in building a world class advertising platform and the Ads team is responsible for defining and performance advertising products that drive discovery, sales and profits. The team operates an end to end advertising platform that includes a scalable ad service that serves hundreds of millions of impressions each day, sophisticated ad matching algorithms, real-time reports, self-service interface for end to end program management etc.\n\nWe are a highly motivated group of Big Data Geeks, Data Scientists and Applications Engineers, working in small agile group to solve sophisticated and high impact problems. We are building smart data systems that ingest, model and analyze massive flow of data from online and offline user activity. We use cutting edge machine learning, data mining and optimization algorithms on ad relevance, ranking and campaign optimization.\n\nJoin us if you want to be spending your time on:\nGathering and analyzing data, identifying modeling and optimization problems, devising solutions and building prototypes;\nFormulating machine learning/statistical approaches while paying attention to business metrics, designing features from the rich data available from many sources, training, evaluating, and deploying models;\nResearching and implementing methodologies to measure the impact of the technologies;\nInitiating and proposing unique and promising modeling projects, developing new and innovative algorithms and technologies, pursuing patents where appropriate;\nDeveloping high-performance algorithms for precision targeting, user engagement prediction, and ad relevance/ranking; testing and implementing these algorithms in scalable, product-ready code; interacting with other teams to define interfaces and understanding and resolving dependencies;\nStaying current on published data mining, machine learning and modeling techniques and competing technologies and sharing these findings with scientists and engineers in the organization;\nMaintaining world-class academic credentials through publications, presentations, external collaborations and service to the research community.\nApply Now: click Apply Now"}}